[
    {
        "title": "Junior Java Developer",
        "url": "https://hh.ru/vacancy/108851432",
        "salary": 0,
        "description": "Experience 0,5 years OR Links to your GitHub with open repositories. Basic knowledge of Java Core and Java J..."
    },
    {
        "title": "Junior Java Developer",
        "url": "https://hh.ru/vacancy/108807175",
        "salary": 0,
        "description": "Использование в работе Java, Spring (core, data, mvc, test), от 6 месяцев. Опыт работы с SQL базами данных. "
    },
    {
        "title": "Java Developer в OMNI CRM",
        "url": "https://hh.ru/vacancy/108846451",
        "salary": 0,
        "description": "Высшее образование. Знание принципов ООП, SOLID, паттернов проектирования. Уверенное знание Java Collection Framework, Java Stream Framework. Опыт и уверенная работа..."
    },
    {
        "title": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108617268",
        "salary": 0,
        "description": "Уверенное знание Java Core, Spring Framework, Spring Boot. Опыт работы с реляционными базами данных MySQL, PostgreSQL. Опыт работы с ActiveMQ..."
    },
    {
        "title": "Middle Java Developer",
        "url": "https://hh.ru/vacancy/88474606",
        "salary": 0,
        "description": "Опыт промышленной разработки на Java от 2-х лет. Уверенное владение Spring. Умение работать с базами данных (Oracle, PostgreSQL). "
    },
    {
        "title": "Java-разработчик (стажер)",
        "url": "https://hh.ru/vacancy/108018543",
        "salary": 0,
        "description": "Уже получил образование, или учишься на последнем курсе магистратуры по технической специальности. Понимаешь принципы ООП, базовые алгоритмы и структуры данных. "
    },
    {
        "title": "Java Developer",
        "url": "https://hh.ru/vacancy/107879064",
        "salary": 0,
        "description": "Иметь хороший опыт с Java от 11 версии. Уметь работать с RabbitMQ. Иметь опыт проектирования на микросервисной архитектуре. "
    },
    {
        "title": "Junior Java Developer/стажер",
        "url": "https://hh.ru/vacancy/108746719",
        "salary": 0,
        "description": "Для участия в обучении необходимо владение следующими технологиями: Приветствуется знание следующих технологий: HTML/CSS. Уровень владения английским языком (минимальный уровень..."
    },
    {
        "title": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108812732",
        "salary": 0,
        "description": "Умение определять алгоритмическую сложность кода. Уверенное знание Java, в том числе Stream API. Уверенное знание Spring. Опыт работы с микросервисной..."
    },
    {
        "title": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108768438",
        "salary": 0,
        "description": "Опыт работы с Java (от 3 лет). Глубокие знания Spring Framework (Spring Boot, Spring Data, Spring Security). Понимание архитектуры микросервисов..."
    },
    {
        "title": "Junior java разработчик",
        "url": "https://hh.ru/vacancy/108663728",
        "salary": 0,
        "description": "Знание теории: Java, Spring, SQL, основ реляционных СУБД, REST (поверх HTTP). Наличие опыта коммерческой разработки на Java от 1 года. "
    },
    {
        "title": "Junior Java-разработчик",
        "url": "https://hh.ru/vacancy/108797555",
        "salary": 0,
        "description": "Наличие опыта работы на стажировке или участие в учебных проектах (также учащиеся последних курсов IT-направлений). Базовые знания ООП, SQL..."
    },
    {
        "title": "Java программист",
        "url": "https://hh.ru/vacancy/108735472",
        "salary": 0,
        "description": "Знание БД Oracle, PostgreSql. ﻿﻿Умение работать на Java 1.8+. Знание ﻿﻿Spring (Spring MVC, Spring Sceurity, Spring Boot). ﻿﻿"
    },
    {
        "title": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108219402",
        "salary": 350000,
        "description": "Опыт командной коммерческой разработки на Java более 3-х лет. Spring Boot. Глубокое знание NoSQL баз данных. Знания CI/CD..."
    },
    {
        "title": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108762655",
        "salary": 0,
        "description": "Опыт разработки программного обеспечения и приложений от 2-3 лет. Знание основных положений OOP. Понимание принципов service oriented architecture (SOA). "
    },
    {
        "title": "Разработчик Java",
        "url": "https://hh.ru/vacancy/108841531",
        "salary": 0,
        "description": "Разобраться в паттернах проектирования и принципах SOLID. Разбираешься в основах информационной безопасности."
    },
    {
        "title": "Middle backend developer",
        "url": "https://hh.ru/vacancy/108626738",
        "salary": 0,
        "description": "Понимание принципов построения эффективных алгоритмов. Опыт работы <highlighttext>Java</highlighttext> <highlighttext>разработчиком</highlighttext> от 2 лет. Уверенное знание Java Core. Понимание Java multithreading, Collections. "
    },
    {
        "title": "Junior Java разработчик",
        "url": "https://hh.ru/vacancy/107856535",
        "salary": 80000,
        "description": "Знания Java Core, Spring (Spring MVC, Spring Web, Spring Boot, Spring AOP, Spring WebFlux), JPA (Hibernate), Junit, Mockito, Git, Jenkins..."
    },
    {
        "title": "Java-разработчик (стажер)",
        "url": "https://hh.ru/vacancy/107587095",
        "salary": 0,
        "description": "Навыки: Java spring framework; SQL; REST API|GrapQL. Обладает уверенными знаниями Spring, JPA, REST API. Отлично знает SQL БД, умеет..."
    },
    {
        "title": "Java разработчик (подработка)",
        "url": "https://hh.ru/vacancy/108892031",
        "salary": 50000,
        "description": "Преимущества: Работать преимущественно автономно. Писать качественный, работоспособный код. Уметь работать преимущественно автономно и на результат."
    }
]